{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing implemented chess features and the files they touch.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the role of each frontend file.",
  "frontend/index.css": "Empty stylesheet file.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main module.",
  "frontend/src/App.tsx": "Main React app controlling game screens, settings, dialogs, board rendering, and pawn promotion handling.",
  "frontend/src/features/chess/ai/evaluation.ts": "AI evaluation logic with piece values, piece-square tables, personality weighting, and win‑probability conversion.",
  "frontend/src/features/chess/ai/getAiMove.ts": "Wrapper that returns the best AI move using the search engine.",
  "frontend/src/features/chess/ai/search.ts": "Minimax with alpha‑beta, difficulty‑based depth, and randomness for evaluating and selecting AI moves.",
  "frontend/src/features/chess/animation/animationTypes.ts": "Type definition for animated chess moves including timing and square data.",
  "frontend/src/features/chess/board2d/Board2D.tsx": "2D chessboard UI rendering squares, pieces, move highlights, and animations.",
  "frontend/src/features/chess/board2d/pieces2d.tsx": "Renders 2D chess pieces using Unicode symbols.",
  "frontend/src/features/chess/board3d/Board3D.tsx": "Renders a 3D chessboard using react-three-fiber with lighting, camera controls, and animated piece movement.",
  "frontend/src/features/chess/board3d/pieces3d.tsx": "Defines 3D geometries and materials for all chess pieces with custom shapes and shading.",
  "frontend/src/features/chess/engine/chessRules.ts": "Implements chess rules including move generation, attack detection, board setup, and game state creation.",
  "frontend/src/features/chess/engine/types.ts": "Contains TypeScript type definitions for pieces, positions, moves, and game state.",
  "frontend/src/features/chess/settings/RestartConfirmDialog.tsx": "Dialog component prompting users to confirm restarting the game when settings change.",
  "frontend/src/features/chess/settings/SettingsPanel.tsx": "UI panel for selecting game settings such as board mode, difficulty, personality, player name, and color.",
  "frontend/src/features/chess/settings/types.ts": "Defines types for settings options including board mode, difficulty, personality, and player color.",
  "frontend/src/features/chess/state/useChessGame.ts": "React hook managing game state, player input, AI turns, move execution, promotions, and animations.",
  "frontend/src/features/chess/ui/CapturedPiecesPanel.tsx": "Displays pieces captured by each player by deriving and sorting them from move history.",
  "frontend/src/features/chess/ui/GameStatusBar.tsx": "Shows current turn, check status, game result messages, and selected game settings.",
  "frontend/src/features/chess/ui/MoveHistory.tsx": "Formats and displays move history in paired rows with basic notation and special move handling.",
  "frontend/src/features/chess/ui/NewGameButton.tsx": "Provides a button that triggers a new game action.",
  "frontend/src/features/chess/ui/PawnPromotionOverlay.tsx": "Renders a modal overlay for selecting a pawn promotion piece with optional cancel action.",
  "frontend/src/features/chess/ui/PreGameScreen.tsx": "Displays initial configuration UI for game settings and a start-game button.",
  "frontend/src/features/chess/ui/QuitButton.tsx": "Button component that triggers a quit-game action.",
  "frontend/src/features/chess/ui/QuitConfirmDialog.tsx": "Confirmation dialog asking the user to confirm quitting the current game.",
  "frontend/src/features/chess/ui/WinProbabilityBar.tsx": "Calculates and displays win probability percentages for white and black based on game state and evaluation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the chess game.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark theme colors and layout.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping App with InternetIdentity and React Query providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and container settings.",
  "project_state.json": "Defines current project state, including requirements to rebuild pawn promotion and improve full chess rules validation."
}