{
  "kind": "build_request",
  "title": "Fix pawn promotion with in-board overlay popup and strengthen full chess rules validation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a pawn-promotion selection flow from scratch for human moves: when a pawn move reaches the last rank, pause move execution and show an in-board overlay popup that lets the player choose the promotion piece (queen, rook, bishop, knight), then apply the move with the chosen promotion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-7",
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "Pawn Promotion Move is not working.",
          "Please create from scratch. Check the logic of chess for the same.",
          "1. pop up\n2. in board overlay",
          "ok, proceed"
        ]
      },
      "acceptanceCriteria": [
        "When a player attempts a pawn move to the last rank, the pawn does not immediately move; instead a promotion overlay appears on top of the board area (not a full-screen page).",
        "The overlay offers exactly four choices: Queen, Rook, Bishop, Knight.",
        "Selecting a piece closes the overlay and completes the move with the correct promoted piece placed on the destination square.",
        "While the promotion overlay is open, normal square selection/moves are blocked until the player selects a promotion piece (or the overlay is dismissed via an explicit cancel action, if implemented).",
        "Promotion works in both 2D and 3D board modes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose promotion state from the game hook and wire the promotion UI to the existing promotion executor so the promotion selection actually completes the pending move (including for AI-vs-player games).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "Pawn Promotion Move is not working.",
          "1. pop up\n2. in board overlay",
          "Yes, Full chess rule validation."
        ]
      },
      "acceptanceCriteria": [
        "The React state that tracks a pending promotion is accessible to the UI layer (e.g., via the hook return value) so the app can render the overlay only when needed.",
        "Choosing a promotion piece calls the existing promotion action and clears the pending promotion state afterward.",
        "If the AI makes a pawn move that reaches the last rank, the game completes the AI move with a valid promotion (default to queen unless the AI move already specifies a promotion)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Strengthen full chess rules validation in the rules engine so check/checkmate/castling safety are correct, including fixing attack detection so pawn forward moves are not treated as attacks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Yes, Full chess rule validation."
        ]
      },
      "acceptanceCriteria": [
        "Check detection is correct for pawn attacks (diagonals only), and does not incorrectly report check due to pawn forward moves.",
        "Castling is only legal when the king is not in check, does not pass through check, and does not end in check; path emptiness and rook presence are validated correctly.",
        "Legal move generation does not allow moves that leave the moving side’s king in check (including en passant edge cases).",
        "Game status correctly transitions among playing/checkmate/stalemate/draw based on the validated legal-move set."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update draw validation to better reflect standard rules for threefold repetition tracking and insufficient material, so “full chess rule validation” does not incorrectly declare draws.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Yes, Full chess rule validation."
        ]
      },
      "acceptanceCriteria": [
        "Threefold repetition detection considers the full position state relevant to repetition (at minimum: piece placement plus side to move; and include castling/en-passant state if represented in state).",
        "Insufficient material detection does not incorrectly return draw for positions that still have mating material, and correctly identifies basic insufficient-material cases (K vs K, K+N vs K, K+B vs K)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only shadcn components); compose new UI components instead.",
    "Do not edit immutable frontend hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend is single-actor Motoko and currently empty; do not introduce multi-canister architectures."
  ],
  "nonGoals": [
    "Do not add third-party chess libraries; implement/fix logic within the existing engine code.",
    "Do not add online multiplayer, real-time play, or persistence of games to the backend.",
    "Do not redesign unrelated UI flows (settings panels, quit confirmation, move history labeling) beyond what is necessary to support the promotion overlay."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}